
line_width = 50
title = 'Table of Contents'
ch1 = 'Chapter 1: Numbers'
ch2 = 'Chapter 2: Letters'
ch3 = 'Chapter 3: Variables'
ch1pg = 'page 1'
ch2pg = 'page 5'
ch3pg = 'page 9'

SAY title~center(line_width)
SAY
SAY ch1~left(line_width/2) || ch1pg~right(line_width/2)
SAY ch2~left(line_width/2) || ch2pg~right(line_width/2)
SAY ch3~left(line_width/2) || ch3pg~right(line_width/2)
